Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/atdf/ATSAMS70Q19.atdf
        <register-group caption="Priority Register A for Slave 0" offset="0x0080" name="MATRIX_PR" size="8" count="9" name-in-module="MATRIX_PR"/>
        <register caption="Master Remap Control Register" name="MATRIX_MRCR" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Remap Command Bit for Master 0" mask="0x00000001" name="RCB0"/>
          <bitfield caption="Remap Command Bit for Master 1" mask="0x00000002" name="RCB1"/>
          <bitfield caption="Remap Command Bit for Master 2" mask="0x00000004" name="RCB2"/>
          <bitfield caption="Remap Command Bit for Master 3" mask="0x00000008" name="RCB3"/>
          <bitfield caption="Remap Command Bit for Master 4" mask="0x00000010" name="RCB4"/>
          <bitfield caption="Remap Command Bit for Master 5" mask="0x00000020" name="RCB5"/>
          <bitfield caption="Remap Command Bit for Master 6" mask="0x00000040" name="RCB6"/>
          <bitfield caption="Remap Command Bit for Master 8" mask="0x00000100" name="RCB8"/>
        </register>
        <register caption="System I/O Configuration Register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="SMC NAND Flash Chip Select Configuration Register" name="CCFG_SMCNFCS" offset="0x0124" rw="RW" size="4">
          <bitfield caption="SMC NAND Flash Chip Select 0 Assignment" mask="0x00000001" name="SMC_NFCS0"/>
          <bitfield caption="SMC NAND Flash Chip Select 1 Assignment" mask="0x00000002" name="SMC_NFCS1"/>
          <bitfield caption="SMC NAND Flash Chip Select 2 Assignment" mask="0x00000004" name="SMC_NFCS2"/>
          <bitfield caption="SMC NAND Flash Chip Select 3 Assignment" mask="0x00000008" name="SMC_NFCS3"/>
          <bitfield caption="SDRAM Enable" mask="0x00000010" name="SDRAMEN"/>
        </register>
        <register caption="Write Protection Mode Register" name="MATRIX_WPMR" offset="0x01E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MATRIX_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MATRIX_WPSR" offset="0x01E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MATRIX_MCFG__ULBT">
        <value caption="Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next AHB 1-Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts.This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave." name="UNLTD_LENGTH" value="0x0"/>
        <value caption="Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence." name="SINGLE_ACCESS" value="0x1"/>
        <value caption="4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats." name="_4BEAT_BURST" value="0x2"/>
        <value caption="8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats." name="_8BEAT_BURST" value="0x3"/>
        <value caption="16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats." name="_16BEAT_BURST" value="0x4"/>
        <value caption="32-beat Burst -The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats." name="_32BEAT_BURST" value="0x5"/>
        <value caption="64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats." name="_64BEAT_BURST" value="0x6"/>
        <value caption="128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats." name="_128BEAT_BURST" value="0x7"/>
      </value-group>
      <value-group caption="" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters.This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it.This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field.This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11004" version="U">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4" atomic-op="set:PIO_PSR">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4" atomic-op="clear:PIO_PSR">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4" atomic-op="set:PIO_OSR">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4" atomic-op="clear:PIO_OSR">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
